from pymongo import MongoClient

# Создаем соединение с MongoDB
client = MongoClient('mongodb://localhost:27017/')

# Выбираем базу данных
db = client['Elizarov']

# Выбираем коллекцию
competencies_collection = db['testText']

# Список компетенций
competencies = [
    {
        "name": "Стратегическое мышление",
        "questions1": [
            {
                "question": "Вопрос 1",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 2",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 3",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 4",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            }
        ],
        "questions2": [
            {
                "question": "Вопрос 1",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 2",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 3",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 4",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            }
        ],
        "questions3": [
            {
                "question": "Вопрос 1",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 2",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 3",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 4",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            }
        ],
        "questions4": [
            {
                "question": "Вопрос 1",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 2",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 3",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            },
            {
                "question": "Вопрос 4",
                "answers": ["Ответ 1", "Ответ 2", "Ответ 3", "Ответ 4"]
            }
        ]
    }
]
